cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J20A.svd
            <register>
               <name>APBDMASK</name>
               <description>APBD Mask</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SERCOM4_</name>
                     <description>SERCOM4 APB Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM5_</name>
                     <description>SERCOM5 APB Clock Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC4_</name>
                     <description>TCC4 APB Clock Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC0_</name>
                     <description>ADC0 APB Clock Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC1_</name>
                     <description>ADC1 APB Clock Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAC_</name>
                     <description>DAC APB Clock Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2S_</name>
                     <description>I2S APB Clock Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCC_</name>
                     <description>PCC APB Clock Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>NVMCTRL</name>
         <version>U24091.0.0</version>
         <description>Non-Volatile Memory Controller</description>
         <groupName>NVMCTRL</groupName>
         <prependToName>NVMCTRL_</prependToName>
         <baseAddress>0x41004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>NVMCTRL_0</name>
            <value>29</value>
         </interrupt>
         <interrupt>
            <name>NVMCTRL_1</name>
            <value>30</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x0004</resetValue>
               <fields>
                  <field>
                     <name>AUTOWS</name>
                     <description>Auto Wait State Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSPEN</name>
                     <description>Suspend Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WMODE</name>
                     <description>Write Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WMODESelect</name>
                        <enumeratedValue>
                           <name>MAN</name>
                           <description>Manual Write</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADW</name>
                           <description>Automatic Double Word Write</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AQW</name>
                           <description>Automatic Quad Word</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AP</name>
                           <description>Automatic Page Write</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRM</name>
                     <description>Power Reduction Mode during Sleep</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PRMSelect</name>
                        <enumeratedValue>
                           <name>SEMIAUTO</name>
                           <description>NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULLAUTO</name>
                           <description>NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode when system is not in standby mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MANUAL</name>
                           <description>NVM block does not enter low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWS</name>
                     <description>NVM Read Wait States</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AHBNS0</name>
                     <description>Force AHB0 access to NONSEQ, burst transfers are continuously rearbitrated</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBNS1</name>
                     <description>Force AHB1 access to NONSEQ, burst transfers are continuously rearbitrated</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CACHEDIS0</name>
                     <description>AHB0 Cache Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CACHEDIS1</name>
                     <description>AHB1 Cache Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x4</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>EP</name>
                           <description>Erase Page - Only supported in the USER and AUX pages.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EB</name>
                           <description>Erase Block - Erases the block addressed by the ADDR register, not supported in the user page</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WP</name>
                           <description>Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register, not supported in the user page</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WQW</name>
                           <description>Write Quad Word - Writes a 128-bit word at the location addressed by the ADDR register.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWRST</name>
                           <description>Software Reset - Power-Cycle the NVM memory and replay the device automatic calibration procedure and resets the module configuration registers</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LR</name>
                           <description>Lock Region - Locks the region containing the address location in the ADDR register.</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UR</name>
                           <description>Unlock Region - Unlocks the region containing the address location in the ADDR register.</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPRM</name>
                           <description>Sets the power reduction mode.</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CPRM</name>
                           <description>Clears the power reduction mode.</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBC</name>
                           <description>Page Buffer Clear - Clears the page buffer.</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SSB</name>
                           <description>Set Security Bit</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BKSWRST</name>
                           <description>Bank swap and system reset, if SMEE is used also reallocate SMEE data into the opposite BANK</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CELCK</name>
                           <description>Chip Erase Lock - DSU.CE command is not available</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CEULCK</name>
                           <description>Chip Erase Unlock - DSU.CE command is available</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SBPDIS</name>
                           <description>Sets STATUS.BPDIS, Boot loader protection is discarded until CBPDIS is issued or next start-up sequence</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBPDIS</name>
                           <description>Clears STATUS.BPDIS, Boot loader protection is not discarded</description>
                           <value>0x1B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASEES0</name>
                           <description>Activate SmartEEPROM Sector 0, deactivate Sector 1</description>
                           <value>0x30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASEES1</name>
                           <description>Activate SmartEEPROM Sector 1, deactivate Sector 0</description>
                           <value>0x31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEERALOC</name>
                           <description>Starts SmartEEPROM sector reallocation algorithm</description>
                           <value>0x32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SEEFLUSH</name>
                           <description>Flush SMEE data when in buffered mode</description>
                           <value>0x33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LSEE</name>
                           <description>Lock access to SmartEEPROM data from any mean</description>
                           <value>0x34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEE</name>
                           <description>Unlock access to SmartEEPROM data</description>
                           <value>0x35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LSEER</name>
                           <description>Lock access to the SmartEEPROM Register Address Space (above 64KB)</description>
                           <value>0x36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEER</name>
                           <description>Unlock access to the SmartEEPROM Register Address Space (above 64KB)</description>
                           <value>0x37</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDEX</name>
                     <description>Command Execution</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>CMDEXSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Execution Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <description>NVM Parameter</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00060000</resetValue>
               <fields>
                  <field>
                     <name>NVMP</name>
                     <description>NVM Pages</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PSZ</name>
                     <description>Page Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PSZSelect</name>
                        <enumeratedValue>
                           <name>8</name>
                           <description>8 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>16 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32</name>
                           <description>32 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64</name>
                           <description>64 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>128</name>
                           <description>128 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256</name>
                           <description>256 bytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>512</name>
                           <description>512 bytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1024</name>
                           <description>1024 bytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEE</name>
                     <description>SmartEEPROM Supported</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SEESelect</name>
                        <enumeratedValue>
                           <name>A</name>
                           <description>163840 bytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9</name>
                           <description>147456 bytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8</name>
                           <description>131072 bytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>114688 bytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>98304 bytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>81920 bytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>65536 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>49152 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>32768 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>16384 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0</name>
                           <description>0 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
