cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J20A.svd
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>XOSCCTRL[%s]</name>
               <description>External Multipurpose Crystal Oscillator Control</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOWBUFGAIN</name>
                     <description>Low Buffer Gain Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPTAT</name>
                     <description>Oscillator Current Reference</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IMULT</name>
                     <description>Oscillator Current Multiplier</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ENALC</name>
                     <description>Automatic Loop Control Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEN</name>
                     <description>Clock Failure Detector Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWBEN</name>
                     <description>Xosc Clock Switch Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Start-Up Time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE1</name>
                           <description>31 us</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2</name>
                           <description>61 us</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4</name>
                           <description>122 us</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE8</name>
                           <description>244 us</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16</name>
                           <description>488 us</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32</name>
                           <description>977 us</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE64</name>
                           <description>1953 us</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE128</name>
                           <description>3906 us</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE256</name>
                           <description>7813 us</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE512</name>
                           <description>15625 us</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE1024</name>
                           <description>31250 us</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2048</name>
                           <description>62500 us</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4096</name>
                           <description>125000 us</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE8192</name>
                           <description>250000 us</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16384</name>
                           <description>500000 us</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32768</name>
                           <description>1000000 us</description>
                           <value>15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CFDPRESC</name>
                     <description>Clock Failure Detector Prescaler</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CFDPRESCSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>48 MHz</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>24 MHz</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV4</name>
                           <description>12 MHz</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV8</name>
                           <description>6 MHz</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>3 MHz</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV32</name>
                           <description>1.5 MHz</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV64</name>
                           <description>0.75 MHz</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>0.3125 MHz</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLCTRLA</name>
               <description>DFLL48M Control A</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetValue>0x82</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DFLL Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLCTRLB</name>
               <description>DFLL48M Control B</description>
               <addressOffset>0x20</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Operating Mode Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STABLE</name>
                     <description>Stable DFLL Frequency</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LLAW</name>
                     <description>Lose Lock After Wake</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBCRM</name>
                     <description>USB Clock Recovery Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCDIS</name>
                     <description>Chill Cycle Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QLDIS</name>
                     <description>Quick Lock Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BPLCKC</name>
                     <description>Bypass Coarse Lock</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAITLOCK</name>
                     <description>Wait Lock</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLVAL</name>
               <description>DFLL48M Value</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FINE</name>
                     <description>Fine Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>COARSE</name>
                     <description>Coarse Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Multiplication Ratio Difference</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLMUL</name>
               <description>DFLL48M Multiplier</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MUL</name>
                     <description>DFLL Multiply Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FSTEP</name>
                     <description>Fine Maximum Step</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CSTEP</name>
                     <description>Coarse Maximum Step</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLSYNC</name>
               <description>DFLL48M Synchronization</description>
               <addressOffset>0x2C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ENABLE Synchronization Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLCTRLB</name>
                     <description>DFLLCTRLB Synchronization Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLVAL</name>
                     <description>DFLLVAL Synchronization Busy</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLMUL</name>
                     <description>DFLLMUL Synchronization Busy</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>2</dim>
               <dimIncrement>0x14</dimIncrement>
               <name>DPLL[%s]</name>
               <description/>
               <addressOffset>0x30</addressOffset>
               <register>
                  <name>DPLLCTRLA</name>
                  <description>DPLL Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x80</resetValue>
                  <fields>
                     <field>
                        <name>ENABLE</name>
                        <description>DPLL Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ONDEMAND</name>
                        <description>On Demand Control</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DPLLRATIO</name>
                  <description>DPLL Ratio Control</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>LDR</name>
                        <description>Loop Divider Ratio</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>LDRFRAC</name>
                        <description>Loop Divider Ratio Fractional Part</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
