cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J20A.svd
            <register>
               <name>STATUSA</name>
               <description>Peripheral write protection status - Bridge A</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00010000</resetValue>
               <fields>
                  <field>
                     <name>PAC_</name>
                     <description>PAC APB Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PM_</name>
                     <description>PM APB Protect Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCLK_</name>
                     <description>MCLK APB Protect Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTC_</name>
                     <description>RSTC APB Protect Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCCTRL_</name>
                     <description>OSCCTRL APB Protect Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSC32KCTRL_</name>
                     <description>OSC32KCTRL APB Protect Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUPC_</name>
                     <description>SUPC APB Protect Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCLK_</name>
                     <description>GCLK APB Protect Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT_</name>
                     <description>WDT APB Protect Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC_</name>
                     <description>RTC APB Protect Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EIC_</name>
                     <description>EIC APB Protect Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREQM_</name>
                     <description>FREQM APB Protect Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM0_</name>
                     <description>SERCOM0 APB Protect Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM1_</name>
                     <description>SERCOM1 APB Protect Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC0_</name>
                     <description>TC0 APB Protect Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1_</name>
                     <description>TC1 APB Protect Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSB</name>
               <description>Peripheral write protection status - Bridge B</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>USB_</name>
                     <description>USB APB Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSU_</name>
                     <description>DSU APB Protect Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVMCTRL_</name>
                     <description>NVMCTRL APB Protect Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMCC_</name>
                     <description>CMCC APB Protect Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORT_</name>
                     <description>PORT APB Protect Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAC_</name>
                     <description>DMAC APB Protect Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HMATRIX_</name>
                     <description>HMATRIX APB Protect Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVSYS_</name>
                     <description>EVSYS APB Protect Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM2_</name>
                     <description>SERCOM2 APB Protect Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM3_</name>
                     <description>SERCOM3 APB Protect Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC0_</name>
                     <description>TCC0 APB Protect Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC1_</name>
                     <description>TCC1 APB Protect Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2_</name>
                     <description>TC2 APB Protect Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC3_</name>
                     <description>TC3 APB Protect Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMECC_</name>
                     <description>RAMECC APB Protect Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSC</name>
               <description>Peripheral write protection status - Bridge C</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCC2_</name>
                     <description>TCC2 APB Protect Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC3_</name>
                     <description>TCC3 APB Protect Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC4_</name>
                     <description>TC4 APB Protect Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC5_</name>
                     <description>TC5 APB Protect Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDEC_</name>
                     <description>PDEC APB Protect Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AC_</name>
                     <description>AC APB Protect Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AES_</name>
                     <description>AES APB Protect Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRNG_</name>
                     <description>TRNG APB Protect Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICM_</name>
                     <description>ICM APB Protect Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUKCC_</name>
                     <description>PUKCC APB Protect Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QSPI_</name>
                     <description>QSPI APB Protect Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCL_</name>
                     <description>CCL APB Protect Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSD</name>
               <description>Peripheral write protection status - Bridge D</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SERCOM4_</name>
                     <description>SERCOM4 APB Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM5_</name>
                     <description>SERCOM5 APB Protect Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC4_</name>
                     <description>TCC4 APB Protect Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC0_</name>
                     <description>ADC0 APB Protect Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC1_</name>
                     <description>ADC1 APB Protect Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAC_</name>
                     <description>DAC APB Protect Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2S_</name>
                     <description>I2S APB Protect Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCC_</name>
                     <description>PCC APB Protect Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
